{
  "events": [
    {
      "id": "event-lomekwi-tools",
      "name": "Oldest Known Stone Tools (Lomekwi)",
      "time": { "value": 3.3, "unit": "mya" },
      "info": "Stone tools discovered at Lomekwi 3 in Kenya represent the oldest known manufactured artifacts. These pre-Oldowan tools, likely made by Australopithecus or Kenyanthropus, predate the emergence of the Homo genus and push back the origins of tool-making by 700,000 years."
    },
    {
      "id": "event-genus-homo",
      "name": "Genus Homo Appears",
      "time": { "value": 2.8, "unit": "mya" },
      "relates_to": "period-lower-paleolithic",
      "info": "The first members of the genus Homo emerge in East Africa, distinguished from earlier Australopithecines by larger brains and more sophisticated tool use. Homo habilis ('handy man') is among the earliest species, associated with systematic tool manufacturing."
    },
    {
      "id": "event-oldowan-tools",
      "name": "Oldowan Tool Industry Begins",
      "time": { "value": 2.6, "unit": "mya" },
      "relates_to": "period-lower-paleolithic",
      "info": "The Oldowan stone tool tradition emerges in East Africa, associated with early Homo species. These simple choppers and flakes represent the first standardized tool-making technology, persisting for over a million years."
    },
    {
      "id": "event-homo-erectus-fire",
      "name": "Fire Use at Bnot Ya'akov Bridge",
      "time": { "value": 790000, "unit": "years-ago" },
      "relates_to": "period-lower-paleolithic",
      "info": "Evidence from Bnot Ya'akov Bridge in Israel provides the most widely accepted early claim of controlled fire use by Homo erectus or Homo ergaster. Fire enables cooking, warmth, protection, and extends human activity into the night."
    },
    {
      "id": "event-first-fire",
      "name": "Earliest Evidence of Controlled Fire",
      "time": { "value": 1, "unit": "mya" },
      "info": "Evidence from Wonderwerk Cave in South Africa suggests hominins were using controlled fire by this time. Fire provided warmth, protection from predators, and the ability to cook food—potentially enabling the evolution of larger brains."
    },
    {
      "id": "event-oldest-homo-sapiens",
      "name": "Oldest Homo Sapiens Fossils",
      "time": { "value": 300000, "unit": "years-ago" },
      "info": "Fossils from Jebel Irhoud in Morocco represent the earliest known anatomically modern humans. These remains push back the origin of our species by 100,000 years and suggest Homo sapiens evolved across Africa rather than in a single location."
    },
    {
      "id": "event-oldest-burial",
      "name": "Earliest Known Intentional Burial",
      "time": { "value": 100000, "unit": "years-ago" },
      "relates_to": "period-middle-paleolithic",
      "info": "Burials at Qafzeh Cave in Israel provide the earliest clear evidence of intentional human burial, with bodies placed in prepared graves with grave goods. This suggests early symbolic thinking and possibly beliefs about death and afterlife."
    },
    {
      "id": "event-invention-clothing",
      "name": "Invention of Clothing",
      "time": { "value": 170000, "unit": "years-ago" },
      "relates_to": "period-middle-paleolithic",
      "info": "Genetic studies of body lice suggest clothing was invented between 170,000 and 83,000 years ago. Clothing enabled humans to survive in colder climates and was essential for migration into Europe, Asia, and eventually the Americas."
    },
    {
      "id": "event-toba-eruption",
      "name": "Toba Supervolcano Eruption",
      "time": { "value": 75000, "unit": "years-ago" },
      "relates_to": "period-middle-paleolithic",
      "info": "The Toba supervolcano in Sumatra erupts in one of Earth's largest known volcanic events, ejecting 2,800 cubic kilometers of material. Some researchers propose this caused a volcanic winter and human population bottleneck, though this remains debated."
    },
    {
      "id": "event-out-of-africa",
      "name": "Major Human Migration Out of Africa",
      "time": { "value": 70000, "unit": "years-ago" },
      "info": "Homo sapiens begins the major wave of migration out of Africa that will eventually colonize every continent. Genetic evidence suggests a population bottleneck around this time, possibly linked to the Toba supervolcanic eruption."
    },
    {
      "id": "event-oldest-figurative-art",
      "name": "Oldest Figurative Art (Sulawesi Cave)",
      "time": { "value": 45500, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "A cave painting of a warty pig in Sulawesi, Indonesia represents the oldest known figurative artwork. This discovery proves that symbolic artistic expression emerged independently in both Europe and Southeast Asia."
    },
    {
      "id": "event-australia-settlement",
      "name": "Human Settlement of Australia",
      "time": { "value": 40000, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "Indigenous Australians become the first humans to colonize Australia, crossing from Southeast Asia via land bridges and short sea voyages. This represents the earliest known sea crossing by humans and the colonization of an entirely new continent."
    },
    {
      "id": "event-new-guinea-settlement",
      "name": "Human Settlement of New Guinea",
      "time": { "value": 30500, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "New Guinea is populated by colonists from Asia or Australia. The island's inhabitants will later independently develop agriculture, making it one of the few places where farming originated independently."
    },
    {
      "id": "event-gravettian-inventions",
      "name": "Gravettian Culture and Inventions",
      "time": { "value": 28000, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "The Gravettian culture flourishes in Europe, producing sophisticated tools including harpoons, needles, and saws. This period sees the creation of famous Venus figurines and advances in clothing and shelter construction."
    },
    {
      "id": "event-last-glacial-maximum",
      "name": "Last Glacial Maximum",
      "time": { "value": 26500, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "Global ice sheets reach their maximum extent, with sea levels dropping 120 meters below present. Ice covers much of North America and northern Europe. Human populations retreat to refugia, later recolonizing as ice melts."
    },
    {
      "id": "event-oldest-settlement",
      "name": "Oldest Permanent Settlement (Dolní Věstonice)",
      "time": { "value": 25000, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "A settlement of huts built from rocks and mammoth bones near Dolní Věstonice in Moravia (Czech Republic) represents the oldest known permanent human settlement found by archaeologists."
    },
    {
      "id": "event-lion-man",
      "name": "Lion-Man of Hohlenstein-Stadel Carved",
      "time": { "value": 40000, "unit": "years-ago" },
      "info": "The Lion-Man, a 31cm ivory sculpture of a human-lion hybrid found in Germany, is one of the oldest known examples of figurative art and demonstrates sophisticated symbolic thinking and craftsmanship in Ice Age Europe."
    },
    {
      "id": "event-oldest-flute",
      "name": "Oldest Known Musical Instrument",
      "time": { "value": 40000, "unit": "years-ago" },
      "relates_to": "period-upper-paleolithic",
      "info": "Bone flutes discovered in Hohle Fels cave in Germany, made from bird bones and mammoth ivory, represent the earliest known musical instruments. Music likely played important roles in social bonding and ritual."
    },
    {
      "id": "event-chauvet-cave",
      "name": "Chauvet Cave Paintings Created",
      "time": { "value": 36000, "unit": "years-ago" },
      "info": "Artists in southern France create sophisticated paintings of lions, mammoths, rhinoceroses, and other animals in Chauvet Cave. The artistic skill and use of perspective rivals much later artwork."
    },
    {
      "id": "event-lascaux-cave",
      "name": "Lascaux Cave Paintings Created",
      "time": { "value": 17000, "unit": "years-ago" },
      "info": "The famous Lascaux cave paintings in France depict horses, deer, bison, and other animals with remarkable artistry. The 'Hall of Bulls' contains some of the most impressive prehistoric art ever discovered."
    },
    {
      "id": "event-oldest-pottery",
      "name": "Oldest Known Pottery",
      "time": { "value": 20000, "unit": "years-ago" },
      "info": "Ceramic fragments from Xianrendong Cave in China represent the oldest known pottery, created by hunter-gatherers during the Last Glacial Maximum. This predates agriculture and the traditional association of pottery with settled life."
    },
    {
      "id": "event-natufian-culture",
      "name": "Natufian Culture Flourishes",
      "time": { "value": 12500, "unit": "bce" },
      "relates_to": "period-mesolithic",
      "info": "The Natufian culture emerges in the Levant as sedentary hunter-gatherers who may have cultivated wild rye. Living in permanent villages, they represent a crucial transition between mobile foraging and settled agricultural life."
    },
    {
      "id": "event-agriculture-origins",
      "name": "Emergence of Agriculture",
      "time": { "value": 12000, "unit": "years-ago" },
      "relates_to": "period-neolithic",
      "info": "The Neolithic Revolution begins independently in multiple regions as humans start domesticating plants and animals. The Fertile Crescent sees early cultivation of wheat and barley, transforming human society from nomadic to settled."
    },
    {
      "id": "event-first-figs",
      "name": "First Cultivated Figs",
      "time": { "value": 9400, "unit": "bce" },
      "relates_to": "period-neolithic",
      "info": "Parthenocarpic (sterile) figs cultivated at Gilgal I in the Jordan Valley may represent the earliest known instance of agriculture, predating the domestication of wheat, barley, and legumes by about a thousand years."
    },
    {
      "id": "event-jericho-tower",
      "name": "Tower of Jericho Built",
      "time": { "value": 8000, "unit": "bce" },
      "relates_to": "period-neolithic",
      "info": "A round stone tower 8.5 meters high and 8.5 meters in diameter is built at Jericho, one of the oldest known stone monuments. Its purpose remains debated—possibly defensive, ceremonial, or for flood protection."
    },
    {
      "id": "event-mehrgarh-founded",
      "name": "Mehrgarh Settlement Founded",
      "time": { "value": 7000, "unit": "bce" },
      "relates_to": "period-mehrgarh",
      "info": "One of the earliest Neolithic settlements in South Asia is established at Mehrgarh in Balochistan (modern Pakistan). Inhabitants cultivate wheat and barley, domesticate cattle, sheep and goats, and develop mud-brick architecture. This pre-Harappan culture lays the foundation for the later Indus Valley Civilization."
    },
    {
      "id": "event-mehrgarh-pottery",
      "name": "Mehrgarh Pottery and Craft Production",
      "time": { "value": 5500, "unit": "bce" },
      "relates_to": "period-mehrgarh",
      "info": "Mehrgarh develops sophisticated pottery, bead-making, and metallurgy. Artisans create distinctive ceramics and drill tiny beads from semi-precious stones. Evidence of early dentistry—drilling teeth to treat decay—appears at this site, the oldest known dental work."
    },
    {
      "id": "event-catal-huyuk",
      "name": "Çatalhöyük Settlement Founded",
      "time": { "value": 7500, "unit": "bce" },
      "relates_to": "period-neolithic",
      "info": "One of the world's first proto-cities emerges in Anatolia, housing up to 10,000 people. Residents enter homes through roof hatches, decorate walls with murals and reliefs, and bury dead beneath house floors."
    },
    {
      "id": "event-copper-smelting",
      "name": "Earliest Copper Smelting",
      "time": { "value": 5000, "unit": "bce" },
      "relates_to": "period-chalcolithic",
      "info": "Copper smelting begins in the Balkans and possibly independently in other regions. The Vinča culture in Serbia provides some of the oldest securely dated evidence of high-temperature copper working."
    },
    {
      "id": "event-proto-cuneiform",
      "name": "Proto-Cuneiform Writing Appears",
      "time": { "value": 3700, "unit": "bce" },
      "relates_to": "period-chalcolithic",
      "info": "Pictographic proto-writing appears in Sumer for record-keeping, representing the earliest known writing system. Initially used for accounting and administration, it will evolve into full cuneiform script."
    },
    {
      "id": "event-otzi-iceman",
      "name": "Ötzi the Iceman Dies",
      "time": { "value": 3300, "unit": "bce" },
      "relates_to": "period-chalcolithic",
      "info": "A man later known as Ötzi dies in the Alps, his body preserved by ice until discovery in 1991. His copper axe, clothing, and equipment provide extraordinary insight into Chalcolithic life. Evidence suggests he was murdered."
    },
    {
      "id": "event-skara-brae",
      "name": "Skara Brae Settlement Built",
      "time": { "value": 3100, "unit": "bce" },
      "relates_to": "period-neolithic",
      "info": "A stone-built Neolithic village is constructed in Orkney, Scotland, featuring ten clustered houses with stone hearths, beds, cupboards, and a sophisticated drainage system. Occupied for 600 years before abandonment."
    },
    {
      "id": "event-stonehenge",
      "name": "Stonehenge Construction Begins",
      "time": { "value": 3000, "unit": "bce" },
      "relates_to": "period-neolithic",
      "info": "Construction begins on Stonehenge in England, initially as a circular ditch and bank with 56 wooden posts. The famous stone circle is added later, with some stones transported from Wales, 150 miles away."
    },
    {
      "id": "event-yamnaya-expansion",
      "name": "Yamnaya Migrations Begin",
      "time": { "value": 3000, "unit": "bce" },
      "relates_to": "period-bronze-age",
      "info": "Pastoral nomads from the Pontic-Caspian steppe begin expanding into Europe and Asia. These migrations spread Yamnaya ancestry and are thought to have carried Indo-European languages across much of Eurasia."
    },
    {
      "id": "event-cuneiform",
      "name": "Invention of Cuneiform Writing",
      "time": { "value": 3400, "unit": "bce" },
      "relates_to": "period-sumer",
      "info": "The Sumerians develop cuneiform, one of the earliest writing systems. Initially used for record-keeping, it evolves to record literature, law, and science. Cuneiform is adapted by subsequent Mesopotamian civilizations."
    },
    {
      "id": "event-pyramids-giza",
      "name": "Great Pyramids of Giza Built",
      "time": { "value": 2560, "unit": "bce" },
      "relates_to": "period-egypt",
      "info": "Pharaoh Khufu commissions the Great Pyramid, the largest of the Giza pyramids. These monuments demonstrate Egypt's organizational capacity, engineering knowledge, and religious beliefs about the afterlife."
    },
    {
      "id": "event-code-hammurabi",
      "name": "Code of Hammurabi",
      "time": { "value": 1754, "unit": "bce" },
      "relates_to": "period-babylon",
      "info": "Babylonian king Hammurabi promulgates one of the oldest known written legal codes. Its 282 laws cover family, commerce, and criminal matters, establishing the principle of 'an eye for an eye'."
    },
    {
      "id": "event-bronze-age-collapse",
      "name": "Bronze Age Collapse",
      "time": { "value": 1200, "unit": "bce" },
      "relates_to": "period-hittite",
      "info": "A catastrophic period sees the fall of multiple Mediterranean civilizations including the Hittites, Mycenaeans, and others. Causes may include climate change, invasions by 'Sea Peoples', and systemic failures. Ushers in a centuries-long 'dark age'."
    },
    {
      "id": "event-founding-rome",
      "name": "Traditional Founding of Rome",
      "time": { "value": 753, "unit": "bce" },
      "relates_to": "period-rome",
      "info": "According to legend, Romulus founds Rome after killing his twin brother Remus. Archaeological evidence suggests the settlement actually developed gradually from earlier Latin and Etruscan communities."
    },
    {
      "id": "event-first-olympics",
      "name": "First Olympic Games",
      "time": { "value": 776, "unit": "bce" },
      "relates_to": "period-greece",
      "info": "The first recorded Olympic Games are held at Olympia in honor of Zeus. The games become a unifying event for Greek city-states, establishing a four-year cycle and a tradition lasting over a millennium."
    },
    {
      "id": "event-athenian-democracy",
      "name": "Athenian Democracy Established",
      "time": { "value": 508, "unit": "bce" },
      "relates_to": "period-greece",
      "info": "Cleisthenes reforms Athenian government, creating the world's first known democracy. Citizens participate directly in legislation and judicial decisions, though women, slaves, and foreigners are excluded."
    },
    {
      "id": "event-persian-wars",
      "name": "Persian Wars Begin",
      "time": { "value": 499, "unit": "bce" },
      "relates_to": "period-persia-achaemenid",
      "info": "The Ionian Revolt against Persian rule sparks decades of conflict between Greece and Persia. Key battles at Marathon, Thermopylae, and Salamis become legendary, shaping Greek identity and Western historical memory."
    },
    {
      "id": "event-alexander-conquest",
      "name": "Alexander Conquers Persia",
      "time": { "value": 330, "unit": "bce" },
      "relates_to": "period-macedon",
      "info": "Alexander the Great defeats Darius III and conquers the Achaemenid Empire. His campaigns spread Greek culture from Egypt to India, initiating the Hellenistic period of cultural fusion."
    },
    {
      "id": "event-qin-unification",
      "name": "Qin Unifies China",
      "time": { "value": 221, "unit": "bce" },
      "relates_to": "period-qin",
      "info": "Qin Shi Huang conquers rival states and establishes China's first unified empire. He standardizes weights, measures, currency, and writing, and begins construction of the Great Wall. His brutal reign ends after just 15 years."
    },
    {
      "id": "event-punic-wars-end",
      "name": "Rome Destroys Carthage",
      "time": { "value": 146, "unit": "bce" },
      "relates_to": "period-rome",
      "info": "Rome defeats Carthage in the Third Punic War, destroying the city and salting the earth. Rome becomes the dominant power in the Mediterranean, controlling North Africa, Spain, and beyond."
    },
    {
      "id": "event-julius-caesar-assassination",
      "name": "Assassination of Julius Caesar",
      "time": { "value": 44, "unit": "bce" },
      "relates_to": "period-rome",
      "info": "Julius Caesar is assassinated by senators fearing his dictatorial power. His death triggers civil war and ultimately the end of the Roman Republic, as his adopted heir Octavian becomes Emperor Augustus."
    },
    {
      "id": "event-silk-road-established",
      "name": "Silk Road Trade Flourishes",
      "time": { "value": 130, "unit": "bce" },
      "relates_to": "period-han",
      "info": "The Han Dynasty establishes regular diplomatic and trade contact with Central Asia following Zhang Qian's expeditions. The Silk Road connects China with Persia, India, and eventually Rome, facilitating exchange of goods, ideas, and religions."
    },
    {
      "id": "event-fall-western-rome",
      "name": "Fall of Western Roman Empire",
      "time": "0476-09-04",
      "relates_to": "period-rome",
      "info": "Germanic chieftain Odoacer deposes the last Western Roman Emperor, Romulus Augustulus. This date traditionally marks the end of ancient Rome and the beginning of the medieval period in Western Europe."
    },
    {
      "id": "event-justinian-code",
      "name": "Justinian's Code Compiled",
      "time": "0529-04-07",
      "relates_to": "period-byzantine",
      "info": "Emperor Justinian I codifies Roman law into the Corpus Juris Civilis. This compilation preserves and systematizes centuries of legal thought, becoming the foundation of civil law systems throughout Europe."
    },
    {
      "id": "event-islam-founding",
      "name": "Muhammad's Revelation",
      "time": "0610-08-10",
      "relates_to": "period-rashidun",
      "info": "Prophet Muhammad receives his first revelation from the angel Gabriel in a cave near Mecca. This begins the religion of Islam, which will rapidly spread to create one of history's largest empires."
    },
    {
      "id": "event-arab-conquest-persia",
      "name": "Arab Conquest of Persia",
      "time": "0651-01-01",
      "relates_to": "period-rashidun",
      "info": "The Rashidun Caliphate completes the conquest of the Sasanian Persian Empire following the Battle of Nahavand. Persia gradually converts to Islam while retaining its distinct cultural identity."
    },
    {
      "id": "event-battle-tours",
      "name": "Battle of Tours",
      "time": "0732-10-10",
      "relates_to": "period-umayyad",
      "info": "Charles Martel's Frankish forces halt the Umayyad advance into Western Europe near Tours, France. Often seen as a turning point that preserved Christian Europe, though its significance is debated by historians."
    },
    {
      "id": "event-abbasid-revolution",
      "name": "Abbasid Revolution",
      "time": "0750-01-25",
      "relates_to": "period-abbasid",
      "info": "The Abbasids overthrow the Umayyad Caliphate, massacring most of the ruling family. The new dynasty moves the capital to Baghdad and presides over an Islamic Golden Age of science, philosophy, and culture."
    },
    {
      "id": "event-charlemagne-crowned",
      "name": "Charlemagne Crowned Emperor",
      "time": "0800-12-25",
      "info": "Pope Leo III crowns Charlemagne as Emperor of the Romans, reviving the Western Roman imperial title. This marks the beginning of what will become the Holy Roman Empire and establishes the precedent of papal authority to crown emperors."
    },
    {
      "id": "event-maya-classic-collapse",
      "name": "Classic Maya Collapse",
      "time": { "value": 900, "unit": "ce" },
      "relates_to": "period-maya",
      "info": "Major Maya cities in the southern lowlands are abandoned over several decades. Causes may include drought, warfare, overpopulation, and environmental degradation. Maya civilization continues in the northern Yucatan."
    },
    {
      "id": "event-great-schism",
      "name": "Great Schism",
      "time": "1054-07-16",
      "relates_to": "period-byzantine",
      "info": "Mutual excommunications between the Pope and the Patriarch of Constantinople formalize the split between Roman Catholic and Eastern Orthodox Christianity. The divide reflects centuries of theological, political, and cultural divergence."
    },
    {
      "id": "event-genghis-khan-unifies",
      "name": "Genghis Khan Unifies Mongols",
      "time": "1206-01-01",
      "relates_to": "period-mongol",
      "info": "Temujin is proclaimed Genghis Khan ('Universal Ruler') at a great assembly of Mongol tribes. He creates a disciplined military machine that will conquer the largest contiguous land empire in history."
    },
    {
      "id": "event-mongol-sack-baghdad",
      "name": "Mongols Sack Baghdad",
      "time": "1258-02-10",
      "relates_to": "period-mongol",
      "info": "Hulagu Khan's Mongol army destroys Baghdad, ending the Abbasid Caliphate. The city's libraries are destroyed, its population massacred. This marks the end of the Islamic Golden Age and shifts power in the Islamic world."
    },
    {
      "id": "event-black-death",
      "name": "Black Death Reaches Europe",
      "time": "1347-10-01",
      "info": "The bubonic plague arrives in Europe via Genoese trading ships from Crimea. Over the next five years, it kills 30-60% of Europe's population, transforming society, economy, and culture."
    },
    {
      "id": "event-fall-constantinople",
      "name": "Fall of Constantinople",
      "time": "1453-05-29",
      "relates_to": "period-ottoman",
      "info": "Ottoman Sultan Mehmed II captures Constantinople after a 53-day siege, ending the Byzantine Empire. The city becomes Istanbul, capital of the Ottoman Empire. Greek scholars flee west, contributing to the Renaissance."
    },
    {
      "id": "event-columbus-voyage",
      "name": "Columbus Reaches Americas",
      "time": "1492-10-12",
      "info": "Christopher Columbus, sailing for Spain, reaches the Bahamas, initiating sustained European contact with the Americas. This begins the Columbian Exchange and the eventual devastation of indigenous American civilizations."
    },
    {
      "id": "event-tenochtitlan-fall",
      "name": "Fall of Tenochtitlan",
      "time": "1521-08-13",
      "relates_to": "period-aztec",
      "info": "Spanish conquistador Hernán Cortés, allied with indigenous enemies of the Aztecs, captures Tenochtitlan after a brutal siege. The Aztec Empire falls, and Spain establishes New Spain on its ruins."
    },
    {
      "id": "event-inca-fall",
      "name": "Conquest of the Inca Empire",
      "time": "1533-08-29",
      "relates_to": "period-inca",
      "info": "Francisco Pizarro executes the Inca emperor Atahualpa despite receiving an enormous ransom. The Spanish complete their conquest of the Inca Empire, seizing vast quantities of gold and silver."
    },
    {
      "id": "event-mughal-founding",
      "name": "Mughal Empire Founded",
      "time": "1526-04-21",
      "relates_to": "period-mughal",
      "info": "Babur, a descendant of Timur and Genghis Khan, defeats the Delhi Sultanate at the First Battle of Panipat. He establishes the Mughal Empire, which will rule most of the Indian subcontinent for over three centuries."
    },
    {
      "id": "event-taj-mahal",
      "name": "Taj Mahal Completed",
      "time": "1653-01-01",
      "relates_to": "period-mughal",
      "info": "Mughal Emperor Shah Jahan completes the Taj Mahal as a mausoleum for his wife Mumtaz Mahal. The white marble monument becomes one of the world's most recognized symbols of architectural beauty and devotion."
    },
    {
      "id": "event-ottoman-siege-vienna",
      "name": "Siege of Vienna",
      "time": "1683-09-12",
      "relates_to": "period-ottoman",
      "info": "The Ottoman Empire's second siege of Vienna fails when a relief force led by Polish King Jan III Sobieski defeats the Ottoman army. This marks the beginning of Ottoman territorial decline in Europe."
    },
    {
      "id": "event-qing-conquest",
      "name": "Qing Dynasty Established",
      "time": "1644-06-06",
      "relates_to": "period-qing",
      "info": "Manchu forces capture Beijing as the Ming Dynasty collapses. The Qing Dynasty will rule China for nearly 300 years, expanding the empire to its greatest territorial extent."
    },
    {
      "id": "event-french-revolution",
      "name": "French Revolution Begins",
      "time": "1789-07-14",
      "info": "The storming of the Bastille marks the beginning of the French Revolution. Revolutionary ideals of liberty, equality, and fraternity spread across Europe, challenging traditional monarchies and inspiring independence movements."
    },
    {
      "id": "event-opium-wars",
      "name": "First Opium War",
      "time": "1839-09-04",
      "relates_to": "period-qing",
      "info": "Britain attacks China to force continued opium trade, defeating the Qing military. The Treaty of Nanking cedes Hong Kong and opens treaty ports, beginning China's 'Century of Humiliation'."
    },
    {
      "id": "event-meiji-restoration",
      "name": "Meiji Restoration",
      "time": "1868-01-03",
      "relates_to": "period-japan-imperial",
      "info": "Emperor Meiji is restored to power, ending the Tokugawa shogunate. Japan embarks on rapid modernization and industrialization, transforming from feudal society to world power within decades."
    },
    {
      "id": "event-ottoman-end",
      "name": "Ottoman Empire Dissolved",
      "time": "1922-11-01",
      "relates_to": "period-ottoman",
      "info": "The Turkish Grand National Assembly abolishes the Ottoman Sultanate, ending over 600 years of Ottoman rule. Mustafa Kemal Atatürk establishes the secular Republic of Turkey the following year."
    },
    {
      "id": "event-qing-fall",
      "name": "Fall of Qing Dynasty",
      "time": "1912-02-12",
      "relates_to": "period-qing",
      "info": "The last Qing emperor, the child Puyi, abdicates following the Xinhai Revolution. Two thousand years of imperial rule in China ends, replaced by the Republic of China."
    }
  ],
  "periods": [
    {
      "id": "period-lower-paleolithic",
      "name": "Lower Paleolithic",
      "startTime": { "value": 3.3, "unit": "mya" },
      "endTime": { "value": 300000, "unit": "years-ago" },
      "info": "The earliest and longest period of the Stone Age, beginning with the first stone tools at Lomekwi in Kenya. Early hominins including Homo habilis and Homo erectus develop increasingly sophisticated tool-making techniques, from simple Oldowan choppers to the more refined Acheulean hand axes. Fire is controlled, and hominins spread from Africa to Asia and Europe."
    },
    {
      "id": "period-middle-paleolithic",
      "name": "Middle Paleolithic",
      "startTime": { "value": 300000, "unit": "years-ago" },
      "endTime": { "value": 50000, "unit": "years-ago" },
      "info": "The era when anatomically modern Homo sapiens emerges in Africa. Neanderthals thrive in Europe and Western Asia, developing the Mousterian tool culture. This period sees the first definitive evidence of controlled fire use, intentional burials suggesting symbolic thought, invention of clothing, and the beginning of behavioral modernity including language."
    },
    {
      "id": "period-upper-paleolithic",
      "name": "European Upper Paleolithic",
      "startTime": { "value": 50000, "unit": "years-ago" },
      "endTime": { "value": 12000, "unit": "years-ago" },
      "info": "A period of rapid cultural innovation as modern humans spread across the globe. Cave art flourishes at sites like Chauvet and Lascaux. Sophisticated tools including harpoons, needles, and saws are invented. The first permanent settlements appear, humans colonize Australia and the Americas, and Neanderthals go extinct."
    },
    {
      "id": "period-mesolithic",
      "name": "Mesolithic",
      "startTime": { "value": 12000, "unit": "years-ago" },
      "endTime": { "value": 7000, "unit": "bce" },
      "info": "The 'Middle Stone Age' bridges the Paleolithic and Neolithic, beginning as glaciers retreat at the end of the Pleistocene. Characterized by microlithic tools, fishing tackle, and the first canoes. The Natufian culture in the Levant represents sedentary hunter-gatherers who may have begun cultivating wild cereals."
    },
    {
      "id": "period-neolithic",
      "name": "Neolithic",
      "startTime": { "value": 10200, "unit": "bce" },
      "endTime": { "value": 4500, "unit": "bce" },
      "info": "The 'New Stone Age' witnesses the Neolithic Revolution: the transition from hunting-gathering to agriculture and settled life. Crops and animals are domesticated, permanent villages emerge, pottery is invented, and megalithic monuments like Stonehenge are built. This transformation begins in the Fertile Crescent and spreads gradually across the world."
    },
    {
      "id": "period-chalcolithic",
      "name": "Chalcolithic (Copper Age)",
      "startTime": { "value": 5000, "unit": "bce" },
      "endTime": { "value": 3300, "unit": "bce" },
      "info": "A transitional period between the Stone Age and Bronze Age when copper metallurgy first appears alongside stone tools. Copper smelting may have been invented independently in multiple locations. The period sees the rise of the first fortified settlements, increasing social stratification, and the earliest proto-writing systems."
    },
    {
      "id": "period-bronze-age",
      "name": "Bronze Age",
      "startTime": { "value": 3300, "unit": "bce" },
      "endTime": { "value": 1200, "unit": "bce" },
      "info": "The discovery that adding tin to copper creates harder bronze revolutionizes tool and weapon making. The first true civilizations with writing emerge: Sumer, Egypt, the Indus Valley, and Shang China. Long-distance trade networks develop to obtain rare tin. The period ends with a widespread collapse around 1200 BCE affecting many Mediterranean civilizations."
    },
    {
      "id": "period-iron-age",
      "name": "Iron Age",
      "startTime": { "value": 1200, "unit": "bce" },
      "endTime": { "value": 500, "unit": "bce" },
      "info": "Iron working technology spreads, democratizing access to metal tools and weapons since iron ore is far more common than tin. This period sees the rise of classical civilizations in Greece, Rome, Persia, India, and China. Writing becomes widespread, and many regions transition from prehistory to recorded history."
    },
    {
      "id": "period-gobekli-tepe",
      "name": "Göbekli Tepe Culture",
      "startTime": { "value": 9500, "unit": "bce" },
      "endTime": { "value": 8000, "unit": "bce" },
      "info": "A pre-pottery Neolithic culture in southeastern Anatolia that constructed Göbekli Tepe, the world's oldest known monumental architecture. Hunter-gatherers erected massive stone circles with T-shaped pillars carved with animals and symbols, challenging assumptions that organized religion and monumental building required settled agricultural societies. The site was deliberately buried around 8000 BCE for unknown reasons."
    },
    {
      "id": "period-uruk",
      "name": "Uruk Period",
      "startTime": { "value": 4000, "unit": "bce" },
      "endTime": { "value": 3100, "unit": "bce" },
      "info": "The period when Uruk became the world's first true city, with a population reaching 40,000-80,000. Uruk saw the development of proto-cuneiform writing, cylinder seals, monumental architecture (including temples to Inanna), and the first bureaucratic administration. The 'Uruk expansion' spread Mesopotamian culture across the Near East."
    },
    {
      "id": "period-sumer",
      "name": "Sumerian Civilization",
      "startTime": { "value": 4500, "unit": "bce" },
      "endTime": { "value": 1900, "unit": "bce" },
      "info": "The world's first urban civilization emerges in southern Mesopotamia (modern Iraq). Sumerians invent cuneiform writing, the wheel, and the plow. City-states like Ur, Uruk, and Eridu develop complex governments, religions, and the first known literary work, the Epic of Gilgamesh."
    },
    {
      "id": "period-minoan",
      "name": "Minoan Civilization",
      "startTime": { "value": 3000, "unit": "bce" },
      "endTime": { "value": 1100, "unit": "bce" },
      "info": "Europe's first advanced civilization, centered on the island of Crete. The Minoans built elaborate palace complexes at Knossos, Phaistos, and Malia, developed Linear A script (still undeciphered), and created distinctive art featuring bulls, marine life, and acrobatic sports. Their civilization influenced the later Mycenaean Greeks."
    },
    {
      "id": "period-egypt",
      "name": "Ancient Egypt",
      "startTime": { "value": 3150, "unit": "bce" },
      "endTime": { "value": 30, "unit": "bce" },
      "info": "One of history's longest-lasting civilizations, unified under pharaohs who are considered living gods. Egyptians build pyramids, develop hieroglyphic writing, and create a rich religious tradition focused on the afterlife. The civilization endures through multiple dynasties until Roman conquest."
    },
    {
      "id": "period-mehrgarh",
      "name": "Mehrgarh Culture",
      "startTime": { "value": 7000, "unit": "bce" },
      "endTime": { "value": 2600, "unit": "bce" },
      "info": "A pre-Harappan Neolithic culture centered at Mehrgarh in Balochistan, representing the earliest farming community in South Asia. Over 4,000 years, inhabitants develop agriculture, animal husbandry, pottery, metallurgy, and long-distance trade. The culture shows continuous evolution leading directly to the Indus Valley Civilization."
    },
    {
      "id": "period-indus",
      "name": "Indus Valley Civilization",
      "startTime": { "value": 3300, "unit": "bce" },
      "endTime": { "value": 1300, "unit": "bce" },
      "info": "A sophisticated Bronze Age civilization in South Asia with major cities at Mohenjo-daro and Harappa. Features advanced urban planning, standardized weights and measures, and sophisticated drainage systems. Its script remains undeciphered, and its decline is still debated."
    },
    {
      "id": "period-akkad",
      "name": "Akkadian Empire",
      "startTime": { "value": 2334, "unit": "bce" },
      "endTime": { "value": 2154, "unit": "bce" },
      "info": "The world's first empire, founded by Sargon of Akkad who conquers Sumerian city-states and creates a unified state. Akkadian becomes the lingua franca of the ancient Near East. The empire introduces new administrative techniques but collapses after about 180 years."
    },
    {
      "id": "period-babylon",
      "name": "Babylonian Empire",
      "startTime": { "value": 1894, "unit": "bce" },
      "endTime": { "value": 539, "unit": "bce" },
      "info": "A Mesopotamian civilization centered on Babylon. Under Hammurabi, it produces one of history's first law codes. After decline and Assyrian rule, the Neo-Babylonian Empire under Nebuchadnezzar II builds the Hanging Gardens and destroys Jerusalem before falling to Persia."
    },
    {
      "id": "period-phoenicia",
      "name": "Phoenician Civilization",
      "startTime": { "value": 1500, "unit": "bce" },
      "endTime": { "value": 332, "unit": "bce" },
      "info": "Seafaring traders from the Levant who establish a commercial network across the Mediterranean. Phoenicians found Carthage and other colonies, produce purple dye, and create an alphabet that becomes the ancestor of Greek, Latin, Arabic, and Hebrew scripts."
    },
    {
      "id": "period-shang",
      "name": "Shang Dynasty",
      "startTime": { "value": 1600, "unit": "bce" },
      "endTime": { "value": 1046, "unit": "bce" },
      "info": "China's first historically verified dynasty, known for bronze casting, oracle bone divination, and the earliest Chinese writing. The Shang ruled from a series of capitals in the Yellow River valley, with Yin (near Anyang) as their final capital. Their sophisticated bronze vessels and jade artifacts demonstrate advanced craftsmanship."
    },
    {
      "id": "period-zhou",
      "name": "Zhou Dynasty",
      "startTime": { "value": 1046, "unit": "bce" },
      "endTime": { "value": 256, "unit": "bce" },
      "info": "China's longest dynasty, introducing the Mandate of Heaven concept. The early Western Zhou maintains centralized control, but the Eastern Zhou period sees fragmentation into competing states. This era produces Confucius, Laozi, and other foundational Chinese philosophers."
    },
    {
      "id": "period-greece",
      "name": "Ancient Greece",
      "startTime": { "value": 800, "unit": "bce" },
      "endTime": { "value": 146, "unit": "bce" },
      "info": "A civilization of independent city-states that develops democracy, philosophy, theater, and the Olympic Games. Athens and Sparta lead the defense against Persian invasion. Greek culture spreads through Alexander's conquests, becoming the foundation of Western civilization."
    },
    {
      "id": "period-persia-achaemenid",
      "name": "Achaemenid Persian Empire",
      "startTime": { "value": 550, "unit": "bce" },
      "endTime": { "value": 330, "unit": "bce" },
      "info": "The first Persian Empire, founded by Cyrus the Great. At its height under Darius I, it spans from Egypt to India, the largest empire yet seen. Known for religious tolerance, efficient administration via satrapies, and the Royal Road communication system."
    },
    {
      "id": "period-carthage",
      "name": "Carthaginian Empire",
      "startTime": { "value": 814, "unit": "bce" },
      "endTime": { "value": 146, "unit": "bce" },
      "info": "A Phoenician colony that becomes a major Mediterranean power. Carthage controls trade routes and North African territories, coming into conflict with Rome in the Punic Wars. General Hannibal famously crosses the Alps with elephants. Rome ultimately destroys the city entirely."
    },
    {
      "id": "period-qin",
      "name": "Qin Dynasty",
      "startTime": { "value": 221, "unit": "bce" },
      "endTime": { "value": 206, "unit": "bce" },
      "info": "China's first imperial dynasty unifies the warring states under Qin Shi Huang, the 'First Emperor.' Brutal but transformative, the Qin standardizes writing, currency, and measurements, builds the Great Wall's first sections, and creates the Terracotta Army. Collapses shortly after the emperor's death."
    },
    {
      "id": "period-han",
      "name": "Han Dynasty",
      "startTime": { "value": 206, "unit": "bce" },
      "endTime": { "value": 220, "unit": "ce" },
      "info": "One of China's golden ages, so influential that ethnic Chinese still call themselves 'Han people.' The dynasty establishes Confucianism as state ideology, creates the civil service examination, expands the Silk Road trade, and invents paper. Considered a classical era of Chinese civilization."
    },
    {
      "id": "period-rome",
      "name": "Roman Civilization",
      "startTime": { "value": 753, "unit": "bce" },
      "endTime": "0476-09-04",
      "info": "From a small Italian city-state to an empire spanning three continents. Rome evolves from monarchy to republic to empire, developing law, engineering, and military systems that influence the world for millennia. Latin becomes the basis for Romance languages; Roman law underlies Western legal traditions."
    },
    {
      "id": "period-byzantine",
      "name": "Byzantine Empire",
      "startTime": "0330-05-11",
      "endTime": "1453-05-29",
      "info": "The eastern continuation of the Roman Empire, centered on Constantinople. Byzantium preserves Greek and Roman learning, develops Orthodox Christianity, and influences Slavic cultures. Despite gradual territorial losses, it endures for over a millennium until Ottoman conquest."
    },
    {
      "id": "period-mississippian",
      "name": "Mississippian Culture",
      "startTime": { "value": 800, "unit": "ce" },
      "endTime": { "value": 1600, "unit": "ce" },
      "info": "A mound-building Native American civilization of the Midwestern, Eastern, and Southeastern United States. Centered on maize agriculture and characterized by large earthen platform mounds, shell-tempered pottery, and chiefdom-level political organization. Cahokia, near modern St. Louis, was its largest city."
    },
    {
      "id": "period-cahokia",
      "name": "Cahokia",
      "startTime": { "value": 1050, "unit": "ce" },
      "endTime": { "value": 1350, "unit": "ce" },
      "info": "The largest pre-Columbian settlement north of Mexico, located near present-day St. Louis. At its peak around 1100 CE, Cahokia had a population of 10,000-20,000, with Monks Mound being the largest earthen structure in the Americas. The city declined and was abandoned before European contact for reasons still debated."
    },
    {
      "id": "period-rashidun",
      "name": "Rashidun Caliphate",
      "startTime": "0632-06-08",
      "endTime": "0661-01-29",
      "info": "The first Islamic caliphate, led by the 'Rightly Guided' successors of Prophet Muhammad. Under the Rashidun, Islam expands from Arabia to conquer the Sasanian Empire and much of Byzantine territory. Internal conflict leads to the Sunni-Shia split."
    },
    {
      "id": "period-umayyad",
      "name": "Umayyad Caliphate",
      "startTime": "0661-01-29",
      "endTime": "0750-01-25",
      "info": "The first hereditary Islamic dynasty, ruling from Damascus. The Umayyads expand the caliphate to its greatest extent, from Spain to Central Asia. They build the Dome of the Rock and develop Islamic administrative systems before being overthrown by the Abbasids."
    },
    {
      "id": "period-tang",
      "name": "Tang Dynasty",
      "startTime": "0618-06-18",
      "endTime": "0907-06-04",
      "info": "Considered China's most cosmopolitan dynasty and a high point of Chinese civilization. The Tang capital Chang'an is the world's largest city. Poetry, art, and trade flourish; Buddhism reaches its peak influence. The Silk Road brings foreign cultures, religions, and peoples."
    },
    {
      "id": "period-abbasid",
      "name": "Abbasid Caliphate",
      "startTime": "0750-01-25",
      "endTime": "1258-02-10",
      "info": "The Islamic Golden Age flourishes under the Abbasids, who move the capital to Baghdad. The House of Wisdom translates Greek, Persian, and Indian texts. Advances in mathematics, astronomy, medicine, and philosophy transform world knowledge. Power declines before Mongol destruction."
    },
    {
      "id": "period-song",
      "name": "Song Dynasty",
      "startTime": "0960-02-04",
      "endTime": "1279-03-19",
      "info": "A period of economic revolution and technological innovation in China. The Song develop movable type printing, gunpowder weapons, the compass, and paper money. Commercial cities thrive, but military weakness leads to loss of northern China and eventual Mongol conquest."
    },
    {
      "id": "period-ghana",
      "name": "Ghana Empire",
      "startTime": { "value": 300, "unit": "ce" },
      "endTime": { "value": 1200, "unit": "ce" },
      "info": "The first major West African empire, controlling trans-Saharan gold and salt trade. Not related to modern Ghana, it was located in present-day Mauritania and Mali. Ghana's wealth inspires later empires including Mali and Songhai."
    },
    {
      "id": "period-mali",
      "name": "Mali Empire",
      "startTime": { "value": 1235, "unit": "ce" },
      "endTime": { "value": 1600, "unit": "ce" },
      "info": "A West African empire that succeeds Ghana, controlling gold and salt trade. Under Mansa Musa, Mali becomes fabulously wealthy; his pilgrimage to Mecca reportedly crashes gold prices in Egypt. Timbuktu becomes a center of Islamic learning."
    },
    {
      "id": "period-mongol",
      "name": "Mongol Empire",
      "startTime": "1206-01-01",
      "endTime": "1368-09-14",
      "info": "The largest contiguous land empire in history, founded by Genghis Khan. Mongol conquests devastate populations from China to Eastern Europe but also facilitate unprecedented exchange along the Silk Road. The empire fragments into khanates that rule much of Eurasia."
    },
    {
      "id": "period-ottoman",
      "name": "Ottoman Empire",
      "startTime": "1299-01-01",
      "endTime": "1922-11-01",
      "info": "One of history's longest-lasting empires, spanning Southeast Europe, Western Asia, and North Africa. The Ottomans capture Constantinople, threaten Vienna, and control the Islamic holy cities. The empire develops distinctive art, architecture, and the millet system for religious minorities."
    },
    {
      "id": "period-ming",
      "name": "Ming Dynasty",
      "startTime": "1368-01-23",
      "endTime": "1644-04-25",
      "info": "A Chinese dynasty known for stability, cultural refinement, and the Forbidden City. The early Ming sponsors Zheng He's massive naval expeditions, but later turns inward. Ming porcelain, literature, and philosophy reach new heights before Manchu conquest."
    },
    {
      "id": "period-qing",
      "name": "Qing Dynasty",
      "startTime": "1644-06-06",
      "endTime": "1912-02-12",
      "info": "China's last imperial dynasty, founded by Manchu conquerors. The Qing expand China to its greatest territorial extent, including Tibet, Xinjiang, and Taiwan. After initial prosperity, the dynasty declines through corruption, rebellions, and foreign imperialism."
    }
  ],
  "connectors": [
    {
      "id": "conn-lower-middle-paleo",
      "fromId": "period-lower-paleolithic",
      "toId": "period-middle-paleolithic",
      "type": "defined",
      "metadata": {
        "note": "Emergence of Homo sapiens marks transition to Middle Paleolithic"
      }
    },
    {
      "id": "conn-middle-upper-paleo",
      "fromId": "period-middle-paleolithic",
      "toId": "period-upper-paleolithic",
      "type": "defined",
      "metadata": {
        "note": "Behavioral modernity and migration out of Africa"
      }
    },
    {
      "id": "conn-upper-paleo-mesolithic",
      "fromId": "period-upper-paleolithic",
      "toId": "period-mesolithic",
      "type": "defined",
      "metadata": {
        "note": "End of last Ice Age transforms environments and cultures"
      }
    },
    {
      "id": "conn-mesolithic-neolithic",
      "fromId": "period-mesolithic",
      "toId": "period-neolithic",
      "type": "defined",
      "metadata": {
        "note": "Agricultural revolution transforms human societies"
      }
    },
    {
      "id": "conn-neolithic-chalcolithic",
      "fromId": "period-neolithic",
      "toId": "period-chalcolithic",
      "type": "defined",
      "metadata": {
        "note": "First metal working emerges alongside stone tools"
      }
    },
    {
      "id": "conn-chalcolithic-bronze",
      "fromId": "period-chalcolithic",
      "toId": "period-bronze-age",
      "type": "defined",
      "metadata": {
        "note": "Discovery of bronze alloy revolutionizes metallurgy"
      }
    },
    {
      "id": "conn-bronze-iron",
      "fromId": "period-bronze-age",
      "toId": "period-iron-age",
      "type": "defined",
      "metadata": {
        "note": "Iron working spreads, democratizing access to metal"
      }
    },
    {
      "id": "conn-neolithic-gobekli",
      "fromId": "period-neolithic",
      "toId": "period-gobekli-tepe",
      "type": "defined",
      "metadata": {
        "note": "Göbekli Tepe represents early Neolithic monumental construction"
      }
    },
    {
      "id": "conn-neolithic-sumer",
      "fromId": "period-neolithic",
      "toId": "period-sumer",
      "type": "defined",
      "metadata": {
        "note": "Sumerian civilization emerges from Neolithic farming communities"
      }
    },
    {
      "id": "conn-bronze-egypt",
      "fromId": "period-bronze-age",
      "toId": "period-egypt",
      "type": "defined",
      "metadata": {
        "note": "Egyptian civilization flourishes during Bronze Age"
      }
    },
    {
      "id": "conn-bronze-indus",
      "fromId": "period-bronze-age",
      "toId": "period-indus",
      "type": "defined",
      "metadata": {
        "note": "Indus Valley civilization emerges as Bronze Age culture"
      }
    },
    {
      "id": "conn-mehrgarh-indus",
      "fromId": "period-mehrgarh",
      "toId": "period-indus",
      "type": "defined",
      "metadata": {
        "note": "Mehrgarh's pre-Harappan culture evolves into Indus Valley Civilization"
      }
    },
    {
      "id": "conn-neolithic-mehrgarh",
      "fromId": "period-neolithic",
      "toId": "period-mehrgarh",
      "type": "defined",
      "metadata": {
        "note": "Mehrgarh represents early Neolithic farming in South Asia"
      }
    },
    {
      "id": "conn-iron-greece",
      "fromId": "period-iron-age",
      "toId": "period-greece",
      "type": "defined",
      "metadata": {
        "note": "Greek civilization develops during Iron Age"
      }
    },
    {
      "id": "conn-iron-rome",
      "fromId": "period-iron-age",
      "toId": "period-rome",
      "type": "defined",
      "metadata": {
        "note": "Rome founded during Iron Age"
      }
    },
    {
      "id": "conn-sumer-akkad",
      "fromId": "period-sumer",
      "toId": "period-akkad",
      "type": "defined",
      "metadata": {
        "note": "Akkadian Empire conquers and absorbs Sumerian city-states"
      }
    },
    {
      "id": "conn-akkad-babylon",
      "fromId": "period-akkad",
      "toId": "period-babylon",
      "type": "defined",
      "metadata": {
        "note": "Babylon rises from Akkadian cultural foundations"
      }
    },
    {
      "id": "conn-sumer-babylon",
      "fromId": "period-sumer",
      "toId": "period-babylon",
      "type": "defined",
      "metadata": {
        "note": "Babylonians inherit Sumerian writing, religion, and knowledge"
      }
    },
    {
      "id": "conn-babylon-persia",
      "fromId": "period-babylon",
      "toId": "period-persia-achaemenid",
      "type": "defined",
      "metadata": {
        "note": "Cyrus the Great conquers Babylon peacefully"
      }
    },
    {
      "id": "conn-phoenicia-greece",
      "fromId": "period-phoenicia",
      "toId": "period-greece",
      "type": "defined",
      "metadata": {
        "note": "Greeks adopt and adapt the Phoenician alphabet"
      }
    },
    {
      "id": "conn-phoenicia-carthage",
      "fromId": "period-phoenicia",
      "toId": "period-carthage",
      "type": "defined",
      "metadata": {
        "note": "Phoenicians found Carthage as a colony"
      }
    },
    {
      "id": "conn-greece-rome",
      "fromId": "period-greece",
      "toId": "period-rome",
      "type": "defined",
      "metadata": {
        "note": "Rome conquers Greece but absorbs Greek culture"
      }
    },
    {
      "id": "conn-rome-egypt",
      "fromId": "period-rome",
      "toId": "period-egypt",
      "type": "defined",
      "metadata": {
        "note": "Rome conquers Ptolemaic Egypt, ending ancient Egyptian civilization"
      }
    },
    {
      "id": "conn-rome-byzantine",
      "fromId": "period-rome",
      "toId": "period-byzantine",
      "type": "defined",
      "metadata": {
        "note": "Byzantine Empire continues Eastern Roman tradition"
      }
    },
    {
      "id": "conn-zhou-qin",
      "fromId": "period-zhou",
      "toId": "period-qin",
      "type": "defined",
      "metadata": {
        "note": "Qin conquers warring states, ending Zhou era"
      }
    },
    {
      "id": "conn-qin-han",
      "fromId": "period-qin",
      "toId": "period-han",
      "type": "defined",
      "metadata": {
        "note": "Han Dynasty succeeds Qin, preserving unified empire"
      }
    },
    {
      "id": "conn-rashidun-umayyad",
      "fromId": "period-rashidun",
      "toId": "period-umayyad",
      "type": "defined",
      "metadata": {
        "note": "Umayyads establish hereditary caliphate after civil war"
      }
    },
    {
      "id": "conn-umayyad-abbasid",
      "fromId": "period-umayyad",
      "toId": "period-abbasid",
      "type": "defined",
      "metadata": {
        "note": "Abbasid revolution overthrows Umayyads"
      }
    },
    {
      "id": "conn-tang-song",
      "fromId": "period-tang",
      "toId": "period-song",
      "type": "defined",
      "metadata": {
        "note": "Song reunifies China after Tang collapse"
      }
    },
    {
      "id": "conn-abbasid-mongol",
      "fromId": "period-abbasid",
      "toId": "period-mongol",
      "type": "defined",
      "metadata": {
        "note": "Mongols destroy Baghdad, ending Abbasid Caliphate"
      }
    },
    {
      "id": "conn-song-mongol",
      "fromId": "period-song",
      "toId": "period-mongol",
      "type": "defined",
      "metadata": {
        "note": "Mongols conquer Southern Song, unifying China under Yuan"
      }
    },
    {
      "id": "conn-mongol-ming",
      "fromId": "period-mongol",
      "toId": "period-ming",
      "type": "defined",
      "metadata": {
        "note": "Ming rebellion expels Mongol Yuan dynasty"
      }
    },
    {
      "id": "conn-byzantine-ottoman",
      "fromId": "period-byzantine",
      "toId": "period-ottoman",
      "type": "defined",
      "metadata": {
        "note": "Ottomans conquer Constantinople, ending Byzantine Empire"
      }
    },
    {
      "id": "conn-ghana-mali",
      "fromId": "period-ghana",
      "toId": "period-mali",
      "type": "defined",
      "metadata": {
        "note": "Mali Empire succeeds Ghana, controlling gold trade"
      }
    },
    {
      "id": "conn-ming-qing",
      "fromId": "period-ming",
      "toId": "period-qing",
      "type": "defined",
      "metadata": {
        "note": "Manchu conquest replaces Ming with Qing dynasty"
      }
    },
    {
      "id": "conn-chalcolithic-uruk",
      "fromId": "period-chalcolithic",
      "toId": "period-uruk",
      "type": "defined",
      "metadata": {
        "note": "Uruk period emerges from Chalcolithic foundations in Mesopotamia"
      }
    },
    {
      "id": "conn-uruk-sumer",
      "fromId": "period-uruk",
      "toId": "period-sumer",
      "type": "defined",
      "metadata": {
        "note": "Uruk develops into the broader Sumerian civilization with multiple city-states"
      }
    },
    {
      "id": "conn-bronze-minoan",
      "fromId": "period-bronze-age",
      "toId": "period-minoan",
      "type": "defined",
      "metadata": {
        "note": "Minoan civilization flourishes as a Bronze Age maritime culture"
      }
    },
    {
      "id": "conn-minoan-greece",
      "fromId": "period-minoan",
      "toId": "period-greece",
      "type": "defined",
      "metadata": {
        "note": "Minoan culture influences later Greek civilization through Mycenaean intermediaries"
      }
    },
    {
      "id": "conn-bronze-shang",
      "fromId": "period-bronze-age",
      "toId": "period-shang",
      "type": "defined",
      "metadata": {
        "note": "Shang dynasty represents China's Bronze Age civilization"
      }
    },
    {
      "id": "conn-shang-zhou",
      "fromId": "period-shang",
      "toId": "period-zhou",
      "type": "defined",
      "metadata": {
        "note": "Zhou dynasty conquers and succeeds the Shang"
      }
    },
    {
      "id": "conn-mississippian-cahokia",
      "fromId": "period-mississippian",
      "toId": "period-cahokia",
      "type": "defined",
      "metadata": {
        "note": "Cahokia is the largest and most influential Mississippian center"
      }
    }
  ]
}
